<div class="jumbotron">
    <div class="container">
        <h2>Добро пожаловать в наш интернет магазин</h2>

        <p>This is a template for a simple marketing or informational website. It includes a large callout called a
            jumbotron and three supporting pieces of content. Use it as a starting point to create something more
            unique.</p>

        <p><a class="btn btn-primary btn-lg" role="button">Learn more &raquo;</a></p>
    </div>
</div>
<div class="container">
    <div class="row">
        <? foreach ($this->posts as $key => $value) { ?>
            <div class="col-md-4">
                <h2><a href="/?view/<?=$value['id']?>"><?= $value['name'] ?></a></h2>

                <p>Donec id elit non mi porta gravida at eget metus. Fusce dapibus, tellus ac cursus commodo, tortor
                    mauris condimentum nibh, ut fermentum massa justo sit amet risus. Etiam porta sem malesuada magna
                    mollis euismod. Donec sed odio dui. </p>

            </div>
        <? } ?>
    </div>
</div>
<hr>
<footer>
    <div class="container">
    <p>Вас интересует бытовая техника, компьютеры, софт или товары для активного отдыха? Все это вы можете купить прямо
        сейчас, сэкономив уйму времени! Интернет-магазин Rozetka™ с радостью поможет вам избежать необходимости посещать
        десятки магазинов. Вы можете заказать любой товар, не вставая со своего кресла, а наш курьер вовремя доставит
        покупку по указанному адресу. Интернет магазин (Украина) Rozetka™ действует на территории всей страны. Жители
        любых городов могут без лишних хлопот посетить наш интернет-магазин (Харьков, Киев, Донецк и другие города).
        Вне зависимости от того, где вы находитесь на данный момент, вы сможете заказать товар, что, согласитесь, очень
        удобно. Какие же преимущества предлагает наш интернет-магазин электроники, телефонов и прочих товаров? Наиболее
        существенный факт – наличие тысяч позиций, которые гарантированно имеются на складе. Вы сможете посетить наш
        интернет магазин и купить любые товары по невысокой цене. Вам необходим холодильник, стиральная машина или
        микроволновая печь?
        Интернет магазин бытовой техники (Киев, Харьков, Донецк) поможет вам. Наличие множества решений позволит
        подобрать устройство с требуемыми характеристиками и стоимостью. Интернет-магазин техники (Харьков,
        Днепропетровск, Донецк) Rozetka – это многообразие предложений на любой вкус. Чтобы заказать товар, вам не
        придется никуда ехать или идти, т.к. все операции совершаются в виртуальном режиме. Именно поэтому Rozetka – это
        интернет-магазин телевизоров, холодильников и иной техники, покупать в котором выгодно и приятно.
        Нередко случается и так, что нам необходимо срочно купить сотовый телефон при потере собственного аппарата, или
        же чтобы порадовать близкого человека приятным подарком. В этом случае вам достаточно обратиться в
        интернет-магазин мобильных телефонов Rozetka™. Сотни моделей от ведущих мировых производителей предлагаются
        вашему вниманию. Заказ мобильных телефонов в нашем интернет-магазине можно произвести из любого города (Киев,
        Харьков, Одесса и т.д.), даже не выходя из дома. Это снимет с ваших плеч массу проблем, и позволит вовремя
        получить средство связи, без которого крайне трудно обойтись в наши дни.
        И, конечно, нельзя забывать о компьютерах, ноутбуках и периферийных устройствах. Интернет-магазин ноутбуков
        Rozetka™ предлагает широчайший выбор лэптопов. Вы легко подберете аппарат для работы или развлечений. Наш
        интернет-магазин (Украина) компьютерной техники сотрудничает с ведущими мировыми производителями. Посетив наш
        интернет-магазин ноутбуков и компьютерной техники, вы без труда приобретете лучшие решения от наиболее известных
        компаний.
        Помимо всего перечисленного интернет-магазин (Украина) Rozetka™ имеет десятки иных разделов. МР3 плееры, товары
        для детей и подростков, аксессуары для туризма, рыбалки и охоты – все это содержится в каталоге. Чтобы сделать
        заказ в интернет магазине техники Rozetka, достаточно выполнить несколько простых действий. Выбрать товар,
        нажать кнопку «Купить» и заполнить простую форму заказа, после чего курьер доставит покупку по указанному вами
        адресу. Оплатить заказ в интернет-магазине (Харьков, Днепропетровск, Одесса и иные города) вы сможете наиболее
        удобным для вас способом. Возможна оплата наличными курьеру интернет-магазина в Киеве. Если вы проживаете в
        другом городе, и заказываете товар в нашем интернет-магазине из Харькова, Донецка или Днепропетровска, вы можете
        заплатить с помощью банковского перевода.</p></div>
</footer>